Repository: spyder-ide/spyder-terminal
Catalog: spyder_terminal/locale/*/LC_MESSAGES/spyder_terminal.po
Languages: de, es, fr, pt_br

source: Terminal shell
es: Consola del sistema
fr: Commande shell
pt_br: Terminal do shell

source: Select the shell interpreter:
de: Wählen Sie den Shell-Interpreter aus:
es: Seleccione el intérprete de shell
fr: Sélectionnez l'interpréteur de shell :
pt_br: Selecione o interpretador do shell:

source: Terminal display preferences
de: Terminal-Anzeigeeinstellungen
es: Preferencias de estilo de la consola
fr: Préférences d'affichage du terminal

source: Buffer limit:
de: Pufferlimit:
es: Limite del historial:
fr: Limite du tampon:

source: Terminal style preferences
de: Terminal-Stil-Einstellungen
es: Preferencias de estilo de la consola
fr: Préférences de style du terminal
pt_br: Preferências de estilo do terminal

source: Bar
es: Barra
fr: Barre
pt_br: Barra

source: Block
es: Bloque
fr: Bloc
pt_br: Bloco

source: Underline
es: Raya al piso
fr: Souligné
pt_br: Sublinhado

source: Type of cursor:
es: Tipo de cursor
fr: Style du curseur:
pt_br: Tipo de cursor:

source: Enable bell sound
de: Glockenton aktivieren
es: Habilitar sonido de campana
fr: Activer le son de cloche
pt_br: Habilitar som de alerta

source: Enable bell sound on terminal
de: Glockenton im Terminal aktivieren
es: Habilitar sonido de campana en la consola
fr: Activer le son de cloche sur le terminal
pt_br: Habilitar som de alerta no terminal

source: Enable cursor blink
de: Blinken der Schreibmarke aktivieren
es: Activar cursor intermitente
fr: Activer le clignotement du curseur

source: _Enable cursor blink on terminal
de: Blinken der Schreibmarke im Terminal _aktivieren
es: _Habilitar cursor intermitente en la terminal
fr: _Activer le clignotement du curseur sur le terminal

source: Terminal
es: Consola

source: Create system terminals inside Spyder.
de: Systemterminals innerhalb von Spyder erstellen.
es: Crear terminales de sistema dentro de Spyder.
fr: Créer des terminaux système dans Spyder.

source: Unfortunately, the library that <b>spyder-terminal</b> uses to create terminals is failing to work in your system. Therefore, this plugin will be deactivated.<br><br> This usually happens on Windows 7 systems. If that's the case, please consider updating to a newer Windows version.
de: Leider funktioniert die Bibliothek, die <b>spyder-terminal</b> zum Erstellen von Terminals verwendet, auf Ihrem System nicht. Daher wird dieses Plugin deaktiviert.<br><br> Dies geschieht in der Regel auf Windows-7-Systemen. Wenn das der Fall ist, erwägen Sie bitte, auf eine neuere Windows-Version zu aktualisieren.
es: Desafortunadamente, la librería que <b>spyder-terminal</b> usa para crear las consolas está fallando en su sistema. Debido a ello, este plugin se desactivará.<br><br>Esto usualmente sucede en sistemas Windows 7. Si este es el caso, por favor considere actualizar su versión de Windows.
fr: Malhereusement, la bibliothèque que <b>spyder-terminal</b> utilise pour créer des terminaux ne fonctionne pas dans votre système. Par conséquent, ce plugin sera désactivé.<br><br> Ceci se produit généralement sur Windows 7. Si c'est les cas, veuillez considérer la mise à jour vers une version plus récente de Windows.
pt_br: Infelizmente, a biblioteca que o <b>spyder-terminal</b> usa para criar terminais não está funcionando no seu sistema. Portanto, este plugin será desativado.<br><br> Isso geralmente acontece com sistemas Windows 7. Se for esse o caso, por favor, considere atualizar para uma versão mais recente do Windows.

source: Open a new terminal
de: Neues Terminal öffnen
es: Abrir una nueva consola
fr: Ouvrir un terminal
pt_br: Abrir uma nova janela

source: New terminal in current working directory
de: Neues Terminal im aktuellen Arbeitsverzeichnis
es: Nueva consola en el directorio actual
fr: Nouveau terminal dans le répertoire de travail actuel
pt_br: Novo terminal no diretório de trabalho atual

source: Sets the pwd at the current working directory
es: Genera el pwd en el directorio actual
fr: Définit le pwd dans le répertoire de travail actuel
pt_br: Define o diretório de trabalho como o diretório atual

source: New terminal in current project
de: Neues Terminal im aktuellen Projekt
es: Nueva consola en el proyecto actual
fr: Nouveau terminal dans le répertoire actuel du projet
pt_br: Novo terminal do projeto atual

source: Sets the pwd at the current project directory
es: Genera el pwd en el directorio del proyecto actual
fr: Définit le pwd dans le répertoire actuel du projet
pt_br: Define o diretório de trabalho como o diretório do projeto atual

source: New terminal in current Editor file
de: Neues Terminal in der aktuellen Editordatei
es: Nueva consola en el archivo de Editor actual
fr: Nouveau terminal dans le fichier actuel de l'éditeur
pt_br: Novo terminal no arquivo atual do Editor

source: Sets the pwd at the directory that contains the current opened file
es: Genera el pwd en el directorio que contiene el archivo actual
fr: Définit le pwd dans le fichier en cours
pt_br: Define o diretório de trabalho como o diretório que contém o arquivo aberto

source: Rename terminal
de: Terminal umbenennen
es: Renombre la consola
fr: Renommer le terminal
pt_br: Renomear terminal

source: Copy text
de: Text kopieren
es: Copia texto
fr: Copier le texte
pt_br: Copiar texto

source: Paste text
de: Text einfügen
es: Pega texto
fr: Coller le texte
pt_br: Colar texto

source: Clear terminal
de: Terminal leeren
es: Limpiar la terminal
fr: Effacer le terminal

source: Zoom in
de: Hineinzoomen
es: Acercar
fr: Agrandir

source: Zoom out
de: Hinauszoomen
es: Alejar
fr: Réduire

source: Spyder Terminal Error
de: Spyder-Terminal-Fehler
es: Error de la consola de Spyder
fr: Erreur du Spyder Terminal
pt_br: Erro Terminal do Spyder

source: Terminal server could not be located at <a href="http://127.0.0.1:{0}">http://127.0.0.1:{0}</a>, please restart Spyder on debugging mode and open an issue with the contents of <tt>{1}</tt> and <tt>{2}</tt> files at {3}.
es: El servidor de la consola no se encontró en <a href=“http://127.0.0.1:{0}”>http://127.0.0.1:{0}</a>, por favor reinicie Spyder en modo de debugger y reporte el problema con los contenidos de los archivos <tt>{1}</tt> y <tt>{2}</tt> en {3}.
fr: Le serveur du terminal n'a pas pu être localisé à <a href="http://127.0.0.1:{0}">http://127.0.0.1:{0}</a>, veuillez redémarrer Spyder en mode déboggage et ouvrez un erreur avec les contenues des fichiers <tt>{1}</tt> et <tt>{2}</tt> à {3}.
pt_br: O servidor Terminal não pôde ser localizado em <a href="http://127.0.0.1:{0}">http://127.0.0.1:{0}</a>, por favor reinicie o Spyder no modo de depuração e abra um registro de problema com o conteúdo de <tt>{1}</tt> e <tt>{2}</tt> arquivos em {3}.

source: Spyder Terminal Server Error
de: Spyder-Terminal-Server-Fehler
es: Error del servidor de terminal de Spyder
fr: Erreur de serveur de terminaux Spyder

source: The server that creates terminals failed to start. Please restart Spyder in a system terminal with the command <tt> spyder --debug-info minimal</tt> and open an issue with the contents of <tt>{0}</tt> and <tt>{1}</tt> files at {2}.
de: Der Server, der Terminals erstellt, konnte nicht gestartet werden. Bitte starten Sie Spyder in einem Systemterminal mit dem Befehl <tt> spyder --debug-info minimal</tt> neu und öffnen Sie ein Thema mit den Inhalten der Dateien <tt>{0}</tt> und <tt>{1}</tt> bei {2}.
es: El servidor que crea terminales no pudo iniciarse. Por favor, reinicie Spyder en un terminal del sistema con el comando <tt> spyder --debug-info minimal</tt> y abra una propuesta con el contenido de <tt>{0}</tt> y <tt>{1}</tt> archivos en {2}.
fr: Le serveur qui crée les terminaux n'a pas pu démarrer. Veuillez redémarrer Spyder dans un terminal système avec la commande <tt> spyder --debug-info minimum</tt> et ouvrir un problème avec le contenu des fichiers <tt>{0}</tt> et <tt>{1}</tt> à {2}.
